7767517
62 68
Input            input                    0 1 input
MemoryData       /Constant_3_output_0     0 1 /Constant_3_output_0 0=2
MemoryData       /detection/Constant_11_output_0 0 1 /detection/Constant_11_output_0 0=1
MemoryData       /detection/Constant_3_output_0 0 1 /detection/Constant_3_output_0 0=1
MemoryData       /detection/Constant_4_output_0 0 1 /detection/Constant_4_output_0 0=4
Convolution      /dense_feature_extraction/model/model.0/Conv 1 1 input /dense_feature_extraction/model/model.0/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728
ReLU             /dense_feature_extraction/model/model.1/Relu 1 1 /dense_feature_extraction/model/model.0/Conv_output_0 /dense_feature_extraction/model/model.1/Relu_output_0
Convolution      /dense_feature_extraction/model/model.2/Conv 1 1 /dense_feature_extraction/model/model.1/Relu_output_0 /dense_feature_extraction/model/model.2/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             /dense_feature_extraction/model/model.3/Relu 1 1 /dense_feature_extraction/model/model.2/Conv_output_0 /dense_feature_extraction/model/model.3/Relu_output_0
Pooling          /dense_feature_extraction/model/model.4/MaxPool 1 1 /dense_feature_extraction/model/model.3/Relu_output_0 /dense_feature_extraction/model/model.4/MaxPool_output_0 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      /dense_feature_extraction/model/model.5/Conv 1 1 /dense_feature_extraction/model/model.4/MaxPool_output_0 /dense_feature_extraction/model/model.5/Conv_output_0 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=73728
ReLU             /dense_feature_extraction/model/model.6/Relu 1 1 /dense_feature_extraction/model/model.5/Conv_output_0 /dense_feature_extraction/model/model.6/Relu_output_0
Convolution      /dense_feature_extraction/model/model.7/Conv 1 1 /dense_feature_extraction/model/model.6/Relu_output_0 /dense_feature_extraction/model/model.7/Conv_output_0 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             /dense_feature_extraction/model/model.8/Relu 1 1 /dense_feature_extraction/model/model.7/Conv_output_0 /dense_feature_extraction/model/model.8/Relu_output_0
Pooling          /dense_feature_extraction/model/model.9/MaxPool 1 1 /dense_feature_extraction/model/model.8/Relu_output_0 /dense_feature_extraction/model/model.9/MaxPool_output_0 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      /dense_feature_extraction/model/model.10/Conv 1 1 /dense_feature_extraction/model/model.9/MaxPool_output_0 /dense_feature_extraction/model/model.10/Conv_output_0 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=294912
ReLU             /dense_feature_extraction/model/model.11/Relu 1 1 /dense_feature_extraction/model/model.10/Conv_output_0 /dense_feature_extraction/model/model.11/Relu_output_0
Convolution      /dense_feature_extraction/model/model.12/Conv 1 1 /dense_feature_extraction/model/model.11/Relu_output_0 /dense_feature_extraction/model/model.12/Conv_output_0 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             /dense_feature_extraction/model/model.13/Relu 1 1 /dense_feature_extraction/model/model.12/Conv_output_0 /dense_feature_extraction/model/model.13/Relu_output_0
Convolution      /dense_feature_extraction/model/model.14/Conv 1 1 /dense_feature_extraction/model/model.13/Relu_output_0 /dense_feature_extraction/model/model.14/Conv_output_0 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             /dense_feature_extraction/model/model.15/Relu 1 1 /dense_feature_extraction/model/model.14/Conv_output_0 /dense_feature_extraction/model/model.15/Relu_output_0
Pooling          /dense_feature_extraction/model/model.16/MaxPool 1 1 /dense_feature_extraction/model/model.15/Relu_output_0 /dense_feature_extraction/model/model.16/MaxPool_output_0 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      /dense_feature_extraction/model/model.17/Conv 1 1 /dense_feature_extraction/model/model.16/MaxPool_output_0 /dense_feature_extraction/model/m